r315/disco-ptp/target/stm32f769i-discovery/src/ethernetif.c
    memset (Txbuffer, 0, ETH_TX_DESC_CNT * sizeof (ETH_BufferTypeDef));

    for (q = p; q != NULL; q = q->next)
    {
        if (i >= ETH_TX_DESC_CNT)
            return ERR_IF;

        Txbuffer[i].buffer = q->payload;
        Txbuffer[i].len    = q->len;

        if (i > 0)
        {
            Txbuffer[i - 1].next = &Txbuffer[i];
        }

        if (q->next == NULL)
        {
            Txbuffer[i].next = NULL;
        }

        i++;
    }

    TxConfig.Length   = p->tot_len;
    TxConfig.TxBuffer = Txbuffer;
    TxConfig.pData    = p;

    pbuf_ref (p);

    do
    {
       if (HAL_ETH_Transmit_IT (&EthHandle, &TxConfig) == HAL_OK)
       {
            errval = ERR_OK;
       }
       else
       {
            if (HAL_ETH_GetError (&EthHandle) & HAL_ETH_ERROR_BUSY)
            {
                /* Wait for descriptors to become available */
                osSemaphoreWait (TxPktSemaphore, ETHIF_TX_TIMEOUT);
                HAL_ETH_ReleaseTxPacket (&EthHandle);
                errval = ERR_BUF;
            }
            else
            {
                /* Other error */
                pbuf_free (p);
                errval = ERR_IF;
            }
       }
    } while (errval == ERR_BUF);

    return errval;
}

/**
  * @brief Should allocate a pbuf and transfer the bytes of the incoming
  * packet from the interface into the pbuf.
  *
  * @param netif the lwip network interface structure for this ethernetif
  * @return a pbuf filled with the received packet (including MAC header)
  *         NULL on memory error
  */
static struct pbuf * low_level_input(struct netif *netif)
{
    struct pbuf *p = NULL;

    if(RxAllocStatus == RX_ALLOC_OK) {
        HAL_ETH_ReadData(&EthHandle, (void **)&p);
    }

    return p;
}

/**
  * @brief  Checks whether the specified ETHERNET PTP flag is set or not.
  * @param  flag: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg ETH_PTP_FLAG_TSARU : Addend Register Update
  *     @arg ETH_PTP_FLAG_TSITE : Time Stamp Interrupt Trigger Enable
  *     @arg ETH_PTP_FLAG_TSSTU : Time Stamp Update
  *     @arg ETH_PTP_FLAG_TSSTI  : Time Stamp Initialize
  * @retval The new state of ETHERNET PTP Flag (SET or RESET).
  */
static FlagStatus ll_ptp_get_flag(uint32_t flag)
{
  FlagStatus bitstatus = RESET;

  if ((EthHandle.Instance->PTPTSCR & flag) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/**
  * @brief  Sets the Time Stamp update sign and values.
  * @param  Sign: specifies the PTP Time update value sign.
  *   This parameter can be one of the following values:
  *     @arg ETH_PTP_PositiveTime : positive time value.
  *     @arg ETH_PTP_NegativeTime : negative time value.
  * @param  SecondValue: specifies the PTP Time update second value.
  * @param  SubSecondValue: specifies the PTP Time update sub-second value.
  *   This parameter is a 31 bit value, bit32 correspond to the sign.
  * @retval None
  */
static void ll_ptp_set_time_stamp_update(uint32_t Sign, uint32_t SecondValue, uint32_t SubSecondValue)
{
  /* Set the PTP Time Update High Register */
  EthHandle.Instance->PTPTSHUR = SecondValue;
  /* Set the PTP Time Update Low Register with sign */
  EthHandle.Instance->PTPTSLUR = Sign | SubSecondValue;
}

/**
  * @brief This function is the ethernetif_input task, it is processed when a packet
  * is ready to be read from the interface. It uses the function low_level_input()
  * that should handle the actual reception of bytes from the network
  * interface. Then the type of the received packet is determined and
  * the appropriate input function is called.
  *
  * @param netif the lwip network interface structure for this ethernetif
  */
static void ethernetif_input_thread( void const * argument )
{
  struct pbuf *p;
  struct netif *netif = (struct netif *) argument;

  for( ;; )
  {
    if (osSemaphoreWait(RxPktSemaphore, TIME_WAITING_FOR_INPUT)==osOK)
    {
      do
      {
        p = low_level_input( netif );
        if (p != NULL)
        {
          if (netif->input( p, netif) != ERR_OK )
          {
            pbuf_free(p);
          }
        }
      }while(p!=NULL);
    }
  }
}

/**
  * @brief Should be called at the beginning of the program to set up the
  * network interface. It calls the function low_level_init() to do the
  * actual setup of the hardware.
  *
  * This function should be passed as a parameter to netif_add().
  *
  * @param netif the lwip network interface structure for this ethernetif
  * @return ERR_OK if the loopif is initialized
  *         ERR_MEM if private data couldn't be allocated
  *         any other err_t on error
  */
err_t ethernetif_init(struct netif *netif)
{
  LWIP_ASSERT("netif != NULL", (netif != NULL));

#if LWIP_NETIF_HOSTNAME
  /* Initialize interface hostname */
  netif->hostname = "lwip";
#endif /* LWIP_NETIF_HOSTNAME */

  netif->name[0] = IFNAME0;
  netif->name[1] = IFNAME1;

  /* We directly use etharp_output() here to save a function call.
   * You can instead declare your own function an call etharp_output()
   * from it if you have to do some checks before sending (e.g. if link
   * is available...) */
  netif->output = etharp_output;
  netif->linkoutput = low_level_output;

  /* initialize the hardware */
  low_level_init(netif);

  return ERR_OK;
}

void ethernetif_ptp_init(void)
{
  /* 1- Mask the Time stamp trigger interrupt by setting bit 9 in the MACIMR register. */
  EthHandle.Instance->MACIMR |= ETH_MAC_IT_TST;
  /* 2- Program Time stamp register bit 0 to enable time stamping. */
  EthHandle.Instance->PTPTSCR = ETH_PTPTSCR_TSE | ETH_PTPTSCR_TSSIPV4FE |
        ETH_PTPTSCR_TSSIPV6FE | ETH_PTPTSCR_TSSARFE | ETH_PTPTSCR_TSSMRME;
  /*3- Program the Subsecond increment register based on the PTP clock frequency. */
  EthHandle.Instance->PTPSSIR = ADJ_FREQ_BASE_INCREMENT; /* to achieve 20 ns accuracy, the value is ~ 43 */
  /*4- If you are using the Fine correction method, program the Time stamp addend register
   * and set Time stamp control register bit 5 (addend register update). */
  EthHandle.Instance->PTPTSAR = ADJ_FREQ_BASE_ADDEND;
  /* Enable the PTP block update with the Time Stamp Addend register value */
  EthHandle.Instance->PTPTSCR |= ETH_PTPTSCR_TSARU;
  /*5- Poll the Time stamp control register until bit 5 is cleared. */
  while(ll_ptp_get_flag(ETH_PTP_FLAG_TSARU) == SET);
  /*6- To select the Fine correction method (if required), program Time stamp control register  bit 1. */
  /* Enable the PTP Fine Update method */
  EthHandle.Instance->PTPTSCR |= ETH_PTPTSCR_TSFCU;
  /*7- Program the Time stamp high update and Time stamp low update registers with the appropriate time value. */
  /* Set the PTP Time Update High and Low Register */
  EthHandle.Instance->PTPTSHUR = 0;
  EthHandle.Instance->PTPTSLUR = ETH_PTP_PositiveTime | 0;
  /*8- Set Time stamp control register bit 2 (Time stamp init). */
  EthHandle.Instance->PTPTSCR |= ETH_PTPTSCR_TSSTI;
  /*9- The Time stamp counter starts operation as soon as it is initialized
   * with the value written in the Time stamp update register. */
}

/**
 * @brief
 * 0000: 1 Hz with a pulse width of 125 ms for binary rollover and, of 100 ms for digital rollover
 * 0001: 2 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)
 * 0010: 4 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)
 * 0011: 8 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)
 * 0100: 16 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)
 * ....
 * 1111: 32768 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)
 */
void ethernetif_ptp_set_pps_output(uint8_t freq)
{
    GPIO_InitTypeDef gpio_init;

