r315/disco-ptp/target/stm32f769i-discovery/src/ethernetif.c
    ETH->PTPPPSCR = freq & 0x0f;

    gpio_init.Pin = GPIO_PIN_5;  //LL_GPIO_PIN_8
    gpio_init.Mode = GPIO_MODE_AF_PP;
    gpio_init.Pull = GPIO_NOPULL;
    gpio_init.Speed = GPIO_SPEED_FREQ_LOW;
    gpio_init.Alternate = GPIO_AF11_ETH;
    HAL_GPIO_Init(GPIOB, &gpio_init); //GPIOG
}


void ethernetif_ptp_set_time(struct ptptime_t * timestamp)
{
  uint32_t Sign;
  uint32_t SecondValue;
  uint32_t NanoSecondValue;
  uint32_t SubSecondValue;

  /* determine sign and correct Second and Nanosecond values */
  if(timestamp->tv_sec < 0 || (timestamp->tv_sec == 0 && timestamp->tv_nsec < 0))
  {
    Sign = ETH_PTP_NegativeTime;
    SecondValue = -timestamp->tv_sec;
    NanoSecondValue = -timestamp->tv_nsec;
  }
  else
  {
    Sign = ETH_PTP_PositiveTime;
    SecondValue = timestamp->tv_sec;
    NanoSecondValue = timestamp->tv_nsec;
  }

  /* convert nanosecond to subseconds */
  SubSecondValue = subsecond_to_nanosecond(NanoSecondValue);
  /* Write the offset (positive or negative) in the Time stamp update high and low registers. */
  ll_ptp_set_time_stamp_update(Sign, SecondValue, SubSecondValue);
  /* Set Time stamp control register bit 2 (Time stamp init). */
  EthHandle.Instance->PTPTSCR |= ETH_PTPTSCR_TSSTI;
  /* The Time stamp counter starts operation as soon as it is initialized
   * with the value written in the Time stamp update register. */
  while(ll_ptp_get_flag(ETH_PTP_FLAG_TSSTI) == SET);
}

void ethernetif_ptp_get_time(struct ptptime_t * timestamp)
{
  timestamp->tv_nsec = subsecond_to_nanosecond(EthHandle.Instance->PTPTSLR);
  timestamp->tv_sec = EthHandle.Instance->PTPTSHR;
}

void ethernetif_ptp_update_offset(struct ptptime_t * timeoffset)
{
  uint32_t Sign;
  uint32_t SecondValue;
  uint32_t NanoSecondValue;
  uint32_t SubSecondValue;
  uint32_t addend;

  /* determine sign and correct Second and Nanosecond values */
  if(timeoffset->tv_sec < 0 || (timeoffset->tv_sec == 0 && timeoffset->tv_nsec < 0))
  {
    Sign = ETH_PTP_NegativeTime;
    SecondValue = -timeoffset->tv_sec;
    NanoSecondValue = -timeoffset->tv_nsec;
  }
  else
  {
    Sign = ETH_PTP_PositiveTime;
    SecondValue = timeoffset->tv_sec;
    NanoSecondValue = timeoffset->tv_nsec;
  }

  /* convert nanosecond to subseconds */
  SubSecondValue = subsecond_to_nanosecond(NanoSecondValue);

  /* read old addend register value*/
  addend = EthHandle.Instance->PTPTSAR;

  while(ll_ptp_get_flag(ETH_PTP_FLAG_TSSTU) == SET);
  while(ll_ptp_get_flag(ETH_PTP_FLAG_TSSTI) == SET);

  /* Write the offset (positive or negative) in the Time stamp update high and low registers. */
  ll_ptp_set_time_stamp_update(Sign, SecondValue, SubSecondValue);

  /* Set bit 3 (TSSTU) in the Time stamp control register. */
  EthHandle.Instance->PTPTSCR |= ETH_PTPTSCR_TSSTU;

  /* The value in the Time stamp update registers is added to or subtracted from the system */
  /* time when the TSSTU bit is cleared. */
  while(ll_ptp_get_flag(ETH_PTP_FLAG_TSSTU) == SET);

  /* Write back old addend register value. */
  EthHandle.Instance->PTPTSAR = addend;
  EthHandle.Instance->PTPTSCR |= ETH_PTPTSCR_TSARU;
}

void ethernetif_ptp_adj_freq(int32_t Adj)
{
    uint32_t addend;

  /* calculate the rate by which you want to speed up or slow down the system time
     increments */

  /* precise */
  /*
  int64_t addend;
  addend = Adj;
  addend *= ADJ_FREQ_BASE_ADDEND;
  addend /= 1000000000-Adj;
  addend += ADJ_FREQ_BASE_ADDEND;
  */

  /* 32bit estimation
  ADJ_LIMIT = ((1l<<63)/275/ADJ_FREQ_BASE_ADDEND) = 11258181 = 11 258 ppm*/
  if( Adj > 5120000) Adj = 5120000;
  if( Adj < -5120000) Adj = -5120000;

  addend = ((((275LL * Adj)>>8) * (ADJ_FREQ_BASE_ADDEND >> 24)) >> 6) + ADJ_FREQ_BASE_ADDEND;

  /* Reprogram the Time stamp addend register with new Rate value and set ETH_TPTSCR */
  EthHandle.Instance->PTPTSAR = addend;
  EthHandle.Instance->PTPTSCR |= ETH_PTPTSCR_TSARU;
}

/**
  * @brief  RMII interface watchdog thread
  * @param  argument
  * @retval None
  */
static void RMII_Thread( void const * argument )
{
  (void) argument;

  for(;;)
  {
    /* some unicast good packets are received */
    if(EthHandle.Instance->MMCRGUFCR > 0U)
    {
      /* RMII Init is OK: Delete the Thread */
      osThreadTerminate(NULL);
    }
    else if(EthHandle.Instance->MMCRFCECR > 10U)
    {
      /* ETH received too many packets with CRC errors, resetting RMII */
      SYSCFG->PMC &= ~SYSCFG_PMC_MII_RMII_SEL;
      SYSCFG->PMC |= SYSCFG_PMC_MII_RMII_SEL;

      EthHandle.Instance->MMCCR |= ETH_MMCCR_CR;
    }
    else
    {
      /* Delay 200 ms */
      osDelay(200);
    }
  }
}

/*******************************************************************************
                       Ethernet MSP Routines
*******************************************************************************/
/**
  * @brief  Initializes the ETH MSP.
  * @param  heth: ETH handle
  * @retval None
  */
void HAL_ETH_MspInit(ETH_HandleTypeDef *heth)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  /* Enable GPIOs clocks */
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();

/* Ethernet pins configuration ************************************************/
  /*
        RMII_REF_CLK ----------------------> PA1
        RMII_MDIO -------------------------> PA2
        RMII_MDC --------------------------> PC1
        RMII_MII_CRS_DV -------------------> PA7
        RMII_MII_RXD0 ---------------------> PC4
        RMII_MII_RXD1 ---------------------> PC5
        RMII_MII_TX_EN --------------------> PG11
        RMII_MII_TXD0 ---------------------> PG13
        RMII_MII_TXD1 ---------------------> PG14
  */

  /* Configure PA1, PA2 and PA7 */
  GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStructure.Pull = GPIO_NOPULL;
  GPIO_InitStructure.Alternate = GPIO_AF11_ETH;
  GPIO_InitStructure.Pin = GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_7;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStructure);

  /* Configure PC1, PC4 and PC5 */
  GPIO_InitStructure.Pin = GPIO_PIN_1 | GPIO_PIN_4 | GPIO_PIN_5;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);

  /* Configure PG11, PG13 and PG14 */
  GPIO_InitStructure.Pin =  GPIO_PIN_11 | GPIO_PIN_13 | GPIO_PIN_14;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStructure);

  /* Enable the Ethernet global Interrupt */
  HAL_NVIC_SetPriority(ETH_IRQn, 0x7, 0);
  HAL_NVIC_EnableIRQ(ETH_IRQn);

  /* Enable ETHERNET clock  */
  __HAL_RCC_ETH_CLK_ENABLE();
}

/**
  * @brief  Ethernet Rx Transfer completed callback
  * @param  heth: ETH handle
  * @retval None
  */
void HAL_ETH_RxCpltCallback(ETH_HandleTypeDef *heth)
{
    osSemaphoreRelease(RxPktSemaphore);
}

void HAL_ETH_TxCpltCallback(ETH_HandleTypeDef *heth)
{
    osSemaphoreRelease(TxPktSemaphore);
}

